In [21]:
import numpy as np
import pandas as pd
movies=pd.read_csv("required_data.csv")

q1=movies[['id', 'genres','cast']]
q2=movies[['id', 'cast', 'production_companies', 'year', 'revenue']]

In [2]:
q1.head()

,id,genres,cast
0,19995,"['Action', 'Adventure', 'Fantasy', 'ScienceFic...","['SamWorthington', 'ZoeSaldana', 'SigourneyWea..."
1,285,"['Adventure', 'Fantasy', 'Action']","['JohnnyDepp', 'OrlandoBloom', 'KeiraKnightley..."
2,206647,"['Action', 'Adventure', 'Crime']","['DanielCraig', 'ChristophWaltz', 'LéaSeydoux'..."
3,49026,"['Action', 'Crime', 'Drama', 'Thriller']","['ChristianBale', 'MichaelCaine', 'GaryOldman'..."
4,49529,"['Action', 'Adventure', 'ScienceFiction']","['TaylorKitsch', 'LynnCollins', 'SamanthaMorto..."

In [3]:
q1['genres']=q1['genres'].str.strip('[]').str.replace(' ','').str.replace("'",'').str.replace('"','')
# q1['genres']=q1['genres'].str.split(',')

D:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [4]:
from pandas import Series, DataFrame

s = q1['genres'].str.split(",").apply(Series, 1).stack()
s.index = s.index.droplevel(-1)
s.name = 'genres'
del q1['genres']
q1 = q1.join(s)

In [5]:
q1.head()

      id                                               cast          genres
0  19995  ['SamWorthington', 'ZoeSaldana', 'SigourneyWea...          Action
0  19995  ['SamWorthington', 'ZoeSaldana', 'SigourneyWea...       Adventure
0  19995  ['SamWorthington', 'ZoeSaldana', 'SigourneyWea...         Fantasy
0  19995  ['SamWorthington', 'ZoeSaldana', 'SigourneyWea...  ScienceFiction
1    285  ['JohnnyDepp', 'OrlandoBloom', 'KeiraKnightley...       Adventure

In [6]:
q1['cast']=q1['cast'].str.strip('[]').str.replace(' ','').str.replace("'",'').str.replace('"','')
q1.head()

      id                                               cast          genres
0  19995  SamWorthington,ZoeSaldana,SigourneyWeaver,Step...          Action
0  19995  SamWorthington,ZoeSaldana,SigourneyWeaver,Step...       Adventure
0  19995  SamWorthington,ZoeSaldana,SigourneyWeaver,Step...         Fantasy
0  19995  SamWorthington,ZoeSaldana,SigourneyWeaver,Step...  ScienceFiction
1    285  JohnnyDepp,OrlandoBloom,KeiraKnightley,Stellan...       Adventure

In [7]:
s1 = q1['cast'].str.split(",").apply(Series, 1).stack()
s1.index = s1.index.droplevel(-1)
s1.name = 'cast'
del q1['cast']
q1 = q1.join(s1)

In [8]:
q1.head(1)

      id  genres            cast
0  19995  Action  SamWorthington

In [9]:
list1=q1[q1['genres'] == 'Action'].groupby('cast')['id'].count()

In [10]:
list1.sort_values(ascending=False)[:10]

cast
SamuelL.Jackson         123
BruceWillis              92
ArnoldSchwarzenegger     83
StanLee                  75
NicolasCage              71
SylvesterStallone        71
Jr.                      69
DwayneJohnson            68
JasonStatham             65
PeterStormare            62
Name: id, dtype: int64

Samuel L Jackson has done the most number of action movies.

In [11]:
q2.head()

,id,cast,production_companies,year,revenue
0,19995,"['SamWorthington', 'ZoeSaldana', 'SigourneyWea...","['IngeniousFilmPartners', 'TwentiethCenturyFox...",2009,2787965087
1,285,"['JohnnyDepp', 'OrlandoBloom', 'KeiraKnightley...","['WaltDisneyPictures', 'JerryBruckheimerFilms'...",2007,961000000
2,206647,"['DanielCraig', 'ChristophWaltz', 'LéaSeydoux'...","['ColumbiaPictures', 'Danjaq', 'B24']",2015,880674609
3,49026,"['ChristianBale', 'MichaelCaine', 'GaryOldman'...","['LegendaryPictures', 'WarnerBros.', 'DCEntert...",2012,1084939099
4,49529,"['TaylorKitsch', 'LynnCollins', 'SamanthaMorto...",['WaltDisneyPictures'],2012,284139100

In [22]:
q2['production_companies']=q2['production_companies'].str.strip('[]').str.replace(' ','').str.replace("'",'').str.replace('"','')

D:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [24]:
q2['cast']=q2['cast'].str.strip('[]').str.replace(' ','').str.replace("'",'').str.replace('"','')
q2.head()

,id,cast,year,revenue,production_companies
0,19995,"SamWorthington,ZoeSaldana,SigourneyWeaver,Step...",2009,2787965087,IngeniousFilmPartners
0,19995,"SamWorthington,ZoeSaldana,SigourneyWeaver,Step...",2009,2787965087,TwentiethCenturyFoxFilmCorporation
0,19995,"SamWorthington,ZoeSaldana,SigourneyWeaver,Step...",2009,2787965087,DuneEntertainment
0,19995,"SamWorthington,ZoeSaldana,SigourneyWeaver,Step...",2009,2787965087,LightstormEntertainment
1,285,"JohnnyDepp,OrlandoBloom,KeiraKnightley,Stellan...",2007,961000000,WaltDisneyPictures

In [25]:
s3 = q2['cast'].str.split(",").apply(Series, 1).stack()
s3.index = s3.index.droplevel(-1)
s3.name = 'cast'
del q2['cast']
q2 = q2.join(s3)

In [23]:
s4 = q2['production_companies'].str.split(",").apply(Series, 1).stack()
s4.index = s4.index.droplevel(-1)
s4.name = 'production_companies'
del q2['production_companies']
q2 = q2.join(s4)

In [26]:
q2_2000 = q2[q2['year']>2000]
q2.head()

      id  year     revenue   production_companies               cast
0  19995  2009  2787965087  IngeniousFilmPartners     SamWorthington
0  19995  2009  2787965087  IngeniousFilmPartners         ZoeSaldana
0  19995  2009  2787965087  IngeniousFilmPartners    SigourneyWeaver
0  19995  2009  2787965087  IngeniousFilmPartners        StephenLang
0  19995  2009  2787965087  IngeniousFilmPartners  MichelleRodriguez

In [27]:
q2_2000.head()

      id  year     revenue   production_companies               cast
0  19995  2009  2787965087  IngeniousFilmPartners     SamWorthington
0  19995  2009  2787965087  IngeniousFilmPartners         ZoeSaldana
0  19995  2009  2787965087  IngeniousFilmPartners    SigourneyWeaver
0  19995  2009  2787965087  IngeniousFilmPartners        StephenLang
0  19995  2009  2787965087  IngeniousFilmPartners  MichelleRodriguez

In [28]:
list2=q2_2000[q2_2000['cast']== 'WillSmith'].groupby('production_companies')['revenue'].sum()

In [29]:
list2.sort_values(ascending=False)

production_companies
OverbrookEntertainment                         13332419318
WeedRoadPictures                                7972700350
ColumbiaPictures                                7841863694
WarnerBros.                                     7329494753
RelativityMedia                                 6269185541
HeydayFilms                                     5844959103
AmblinEntertainment                             4887409092
ForwardPass                                     4368205597
BlueLight                                       4368205597
GHThree                                         4368205597
ColumbiaPicturesCorporation                     4366178169
VillageRoadshowPictures                         3906677493
DCEntertainment                                 3725000000
DuneEntertainment                               3725000000
DCComics                                        3725000000
AtlasEntertainment                              3725000000
OriginalFilm                                    3512094060
HemisphereMediaCapital                          3120133880
ImagenationAbuDhabiFZ                           3120133880
Parkes/MacDonaldProductions                     3120133880
MediaMagikEntertainment                         3120133880
Ciné+                                           2332865043
Canal+                                          2332865043
AntonCapitalEntertainment(ACE)                  2332865043
AmazonPrimeInstantVideo                         2332865043
TheWeinsteinCompany                             2332865043
TF1FilmsProduction                              2332865043
TF1                                             2332865043
StudioCanal                                     2332865043
DavisEntertainment                              2083409496
LaurenceMarkProductions                         2083409496
MediastreamVierteFilmGmbH&Co.VermarktungsKG     2083409496
TwentiethCenturyFoxFilmCorporation              2083409496
CanlawsProductions                              2083409496
EscapeArtists                                   1900979944
Parkes+MacDonaldImageNation                     1767275212
DreamWorksAnimation                             1101825057
DreamWorksSKG                                   1101825057
PacificDataImages(PDI)                          1101825057
BlindingEdgePictures                             731529381
DonSimpson/JerryBruckheimerFilms                 546679112
ParamountPictures                                520947045
ApatowProductions                                520947045
GarySanchezProductions                           520947045
RatPac-DuneEntertainment                         461888889
Kramer&SigmanFilms                               461888889
ZaftigFilms                                      461888889
LStarCapital                                     302182740
TheShumanCompany                                 302182740
TheCantillonCompany                              302182740
ScottFreeProductions                             302182740
BeverlyDetroit                                   144393528
CloseCallFilms                                   144393528
MiramaxFilms                                     144393528
ViewAskewProductions                             144393528
Name: revenue, dtype: int64

The total revenue of movies produced by "Twentieth Century Fox Film Corporation" that were released after the year 2000 and had the actor Will Smith in it is $7291933236